"""src/minibacktest/portfolio 下的 sizing 文件内包含两个仓位构造函数:

    1. 直接通过因子打分来排位置, 分 n_quantilies 组, 构造多空对冲
    2. 先将股票的波动率算出, 再根据波动率排序分组, 组内再构造空头和多头, 最后把每组的多头空头分别组合起来


构造原因见: 每次跑完全流程后得到的 Quantile Avg Forward Return 图表中, 五组的排序情况
按照设计来说, 我们通过我们心意中的设计, 手动按照 zscore 高低分组, 应该是可以实现 Q1 ~ Q5 依次递减的效果, 即: 分越高, 后面涨的越多, 
但是在实际操作过程中, 有一个现象是: Q1 和 Q5 组的涨幅都是很高的, 导致 Q5 组的做空策略对我们来说相当于反着买
中间几组的分数低, 收益也低, 这里引出最终问题:

    为什么打分最差的股票, 后面涨的也好? 


排查发现, Q1 与 Q5 两个极端位置的波动率比中间几组的波动率高出不少, 直观理解就是: 

    只有股票一直猛或者一直拉, 才会出现在最两边, 也就是我们该做多的组, 对应数学理解就是, 波动率大

    
在牛市情况下, 波动率高的股票或者 beta 高的股票, 都会比波动率低的股票涨的多, 他们代表着本身波动率高
引起涨幅高和单纯就是 beta 高导致比其他股票高一大截.

在这种情况下, Q1 和 Q5 组虽然最后都应该是我们做多的对象, 却因为不同原因出现在两组中: 

    1. 股票的分数, 确实代表他未来的变化
    2. 本身波动率高, 被市场推着跑


在此基础上, 我们计划通古将本身就波动率差不多的股票全部放在一个组里面, 固定了波动率, 剩下的因素就可能...暂时没有能力确认到底是什么
"""